Repository: raccoongang/problem-builder
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Question ID (name)
pt_br: Identificador da Pergunta (nome)

source: The ID of this block. Should be unique unless you want the answer to be used in multiple places.
pt_br: O identificador deste bloco. Deve ser único, a menos que você queira que a resposta seja usada em múltiplos locais.

source: Default From
pt_br: Padrão de

source: If a question ID is specified, get the default value from this answer.
pt_br: Se o identificador da sua pergunta é especificado, obtenha o valor padrão desta resposta.

source: Min. Allowed Characters
pt_br: Min. Caracteres Permitidos

source: Minimum number of characters allowed for the answer
pt_br: Quantidade mínima de caracteres permitido nessa resposta

source: Question to ask the student
pt_br: Pergunta para perguntar o estudante

source: Defines the maximum total grade of the answer block.
pt_br: Defina a nota total máxima para este bloco de resposta

source: Question {number}
pt_br: Pergunta {number}

source: Question ID
pt_br: Identificador da Pergunta

source: The ID of the question for which to display the student's answer.
pt_br: O identificador da pergunta para o qual exibir na resposta do aluno.

source: Title of this answer recap section
pt_br: Título dessa resposta desta seção de recapitulação

source: Description of this answer (optional). Can include HTML.
pt_br: Descrição desde resposta (optional). Pode incluir HTML.

source: Value of the choice when selected. Should be unique. Generally you do not need to edit this.
pt_br: Valor de opção quando selecionado. Deve ser único. Geralmente você não precisa editar isto.

source: Choice Text
pt_br: Texto de opção

source: Human-readable version of the choice value
pt_br: Versão legível do valor de opção

source: Out of Context
pt_br: Fora de Contexto

source: Choice ({status})
pt_br: Opção ({status})

source: No value set. This choice will not work correctly.
pt_br: Nenhum valor definido. Essa opção não funcionará corretamente.

source: No choice text set yet.
pt_br: Ainda não há texto de opção.

source: This choice has a non-unique ID and won't work properly. This can happen if you duplicate a choice rather than use the Add Choice button.
pt_br: Esta opção tem um identificador não exclusivo e não funciona corretamente. Isso pode acontecer se você duplicar uma opção ao invés de usar o botão Adicionar Escolha.

source: Display name for this module
pt_br: Exibir o nome para este módulo

source: Self-Assessment Summary
pt_br: Resumo de autoavaliação

source: THe url_name of an MCQ to use as a proof of concept for using the submissions API
pt_br: O url_name de um MCQ para usar como prova de conceito para usar a API de submissões

source: Correct Choice[s]
pt_br: Opção(ões) Correta(s)

source: Specify the value[s] that students may select for this question to be considered correct.
pt_br: Especifique o valor[es] que os alunos podem selecionar para esta pergunta ser considerada correta.

source: Acceptable
pt_br: Aceitável

source: Wrong
pt_br: Errado

source: Not Acceptable
pt_br: Não Aceitável

source: No choices set yet.
pt_br: Nenhuma opção definida ainda.

source: You must indicate the correct answer[s], or the student will always get this question wrong.
pt_br: Você deve indicar a(s) resposta(s) correta(s), ou o aluno sempre receberá esta pergunta errada.

source: Duplicate correct choices set
pt_br: Conjunto de opções corretas duplicadas

source: A choice value listed as correct does not exist: {choice}
pt_br: Um valor de opção listado como correto não existe: {choice}

source: Low
pt_br: Baixo

source: Label for low ratings
pt_br: Etiqueta para classificações baixas

source: High
pt_br: Alto

source: Label for high ratings
pt_br: Etiqueta para classificações altas

source: Accepted Choice[s]
pt_br: Opção(ões) Aceitas

source: Specify the rating value[s] that students may select for this question to be considered correct.
pt_br: Especifique o valor de classificação[ões] que os alunos podem selecionar para esta pergunta ser considerada correta.

source: Mode of the mentoring. 'standard' or 'assessment'
pt_br: Modo da mentoria. 'padrão' ou 'avaliação'

source: Followed by
pt_br: Seguido por

source: url_name of the step after the current mentoring block in workflow.
pt_br: url_name da etapa após o bloco de mentoria atual no fluxo de trabalho.

source: Max. Attempts Allowed
pt_br: Máx Tentativas Permitidas

source: Number of max attempts allowed for this questions
pt_br: Número de tentativas máximas permitidas para estas perguntas

source: Enforce Dependency
pt_br: Aplicar Dependência

source: Should the next step be the current block to complete?
pt_br: O próximo passo deve ser o bloco atual a ser concluído?

source: Show Submit Button
pt_br: Mostrar o Botão Enviar

source: Allow submission of the current block?
pt_br: Permitir o envio do bloco atual?

source: XML content
pt_br: Conteúdo XML

source: Not used for version 2. This field is here only to preserve the data needed to upgrade from v1 to v2.
pt_br: Não usado para a versão 2. Este campo está aqui apenas para preservar os dados necessários para atualizar de v1 para v2.

source: Defines the maximum total grade of the block.
pt_br: Define a nota total máxima do bloco.

source: Title (Display name)
pt_br: Título (Nome de exibição)

source: Title to display
pt_br: Titulo para exibir

source: Mentoring Questions
pt_br: Pergutas de Mentoria

source: There should only be one '{msg_type}' message component.
pt_br: Deve haver apenas um componente de mensagem '{msg_type}'.

source: A component inside this mentoring block has issues.
pt_br: Um componente dentro deste bloco de mentoria tem problemas.

source: Message to display upon completion
pt_br: Mensagem a ser exibida após a conclusão

source: Type of message
pt_br: Tipo de mensagem

source: Message when student reaches max. # of attempts ({limit})
pt_br: Mensagem quando o aluno atinge o Nº máximo de tentativas ({limit})

source: Message shown when complete
pt_br: Mensagem exibida quando completo

source: Message shown when incomplete
pt_br: Mensagem exibida quando incompleto

source: Required Choices
pt_br: Opções Obrigatórias

source: Specify the value[s] that students must select for this MRQ to be considered correct.
pt_br: Especifique o[s] valor[es] que os alunos devem selecionar para que este MRQ seja considerado correto.

source: Ignored Choices
pt_br: Opções Ignoradas

source: Specify the value[s] that are neither correct nor incorrect. Any values not listed as required or ignored will be considered wrong.
pt_br: Especifique o[s] valor[es] que não estão corretos nem incorretos. Qualquer valor não listado como obrigatório ou ignorado será considerado errado.

source: Ignored
pt_br: Ignorado

source: Duplicate required choices set
pt_br: Conjunto de opções obrigatórias duplicadas

source: Duplicate ignored choices set
pt_br: Conjunto de opções ignoradas duplicadas

source: A choice is listed as both required and ignored: {}
pt_br: Uma opção é listada como obrigatória e ignorada: {}

source: A choice value listed as required does not exist: {}
pt_br: Um valor de opção listado como obrigatório não existe: {}

source: A choice value listed as ignored does not exist: {}
pt_br: Um valor de opção listado como ignorado não existe: {}

source: The ID of this question (required). Should be unique within this mentoring component.
pt_br: O identificador desta questão (obrigatório). Deve ser único dentro deste componente de mentoria.

source: General feedback provided when submiting
pt_br: Feedback geral fornecido ao enviar

source: Defines the maximum total grade of this question.
pt_br: Define a nota máxima total desta pergunta.

source: A unique Question ID is required.
pt_br: Um identificador de pergunta exclusivo é obrigatório.

source: Question ID should not contain spaces.
pt_br: O identificador da pergunta não deve conter espaços.

source: Some choice values are not unique.
pt_br: Alguns valores de opções não são únicos.

source: Multiple tips configured for the same choice.
pt_br: Várias dicas configuradas para a mesma opção.

source: Display name
pt_br: Nome de Exibição

source: Title of the table
pt_br: Título da tabela

source: Answers Table
pt_br: Tabela de respostas

source: Special Mode
pt_br: Modo Especial

source: Variant of the table that will display a specific background image.
pt_br: Variante da tabela que exibirá uma imagem de plano de fundo específica.

source: Header
pt_br: Cabeçalho

source: Header of this column
pt_br: Cabeçalho desta coluna

source: Text of the tip to show if the student chooses this tip's associated choice[s]
pt_br: Texto da dica para mostrar se o aluno escolhe esta dica associada a opção[ões]

source: For Choices
pt_br: Para Opções

source: List of choices for which to display this tip
pt_br: Lista de opções para as quais exibir esta dica

source: Width
pt_br: Largura

source: Width of the tip popup (e.g. '400px')
pt_br: Largura do pop-up de dica (por exemplo, '400px')

source: Height
pt_br: Altura

source: Height of the tip popup (e.g. '200px')
pt_br: Altura do pop-up de dica (por exemplo, '200px')

source: Tip for {list_of_choices}
pt_br: Dica para {list_of_choices}

source: A choice selected for this tip does not exist.
pt_br: Uma escolha selecionada para esta dica não existe.

source: No answer yet.
pt_br: Ainda sem resposta.

source: Add HTML
pt_br: Adicionar HTML

source: Add Answer Recap
pt_br: Adicionar Resposta de Recapitulação

source: Add Answer Recap Column
pt_br: Adicionar Coluna de Resposta de Recapitulação

source: You need to complete %(link_start)sthe previous step%(link_end)s before attempting this step.
pt_br: Você precisa completar %(link_start)s a etapa anterior%(link_end)s antes de tentar esta etapa.

source: Add New Component
pt_br: Adicionar Novo Componente

source: Long Answer
pt_br: Resposta Longa

source: Multiple Choice Question
pt_br: Pergunta de Múltipla Opção

source: Rating Question
pt_br: Pergunta de avaliação

source: Multiple Response Question
pt_br: Pergunta de Múltipla Resposta

source: Long Answer Recap
pt_br: Resposta Longa de Recapitulação

source: Answer Recap Table
pt_br: Tabela de Resposta de Recapitulação

source: Message (Complete)
pt_br: Mensagem (Completa)

source: Message (Incomplete)
pt_br: Mensagem (Incompleta)

source: Message (Max # Attempts)
pt_br: Mensagem (Nº Máx. de Tentativas)

source: url_name for linking to this mentoring question set:
pt_br: url_name para vincular a este conjunto de perguntas de orientação:

source: Add Custom Choice
pt_br: Adicionar Opção Customizada

source: Add Tip
pt_br: Adicionar Dica

source: Built-in choices:
pt_br: Opções internas:

source: Additional custom choices and tips:
pt_br: Opções e dicas personalizadas adicionais:

source: off
pt_br: Desligado

source: on
pt_br: Ligado

source: Average
pt_br: Médio

source: Quadrant labels
pt_br: Rótulos Quadrantes

source: Compare your plot to others!
pt_br: Compare o seu mapa com os outros!
